# Challenge Set 9
## Hasan Haq

## **Part I: W3Schools SQL Lab**

This challenge uses the W3Schools SQL playground. Please add solutions to this markdown file and submit.

**Q1) Which customers are from the UK?**
<br>A1) 4, 11, 16, 19, 38, 53, 72
<br>```SELECT * from Customers WHERE Country = "UK"```

**Q2) What is the name of the customer who has the most orders?**
<br>A2) Ernst Handel
<br>
```
SELECT 
	Count(OrderID), Customers.CustomerName, Orders.CustomerID
FROM
	Orders
    JOIN
		Customers
	ON 
    	Orders.CustomerID=Customers.CustomerID
GROUP BY
	Customers.CustomerName
ORDER BY
	Count(OrderID) DESC;
```

**Q3) Which supplier has the highest average product price?**
<br>A3) Aux joyeux eccl√©siastiques
<br>
```
SELECT 
	AVG(Price), Suppliers.SupplierName, Suppliers.SupplierID
FROM
	Products
	JOIN
    	Suppliers
    ON
    	Products.SupplierID=Suppliers.SupplierID
GROUP BY
	Suppliers.SupplierName
ORDER BY
	AVG(Price) DESC;
```

**Q4) How many different countries are all the customers from? (Hint: consider DISTINCT.)**
<br>A4) 21
<br>```SELECT COUNT(DISTINCT(Country)) from Customers```

**Q5) What category appears in the most orders?**
<br>A5) Dairy Products
<br>Q5)
```
SELECT 
	Categories.CategoryName,
    COUNT(*)
FROM
	OrderDetails
	JOIN
    	Products
    JOIN
    	Categories
    ON
    	OrderDetails.ProductID = Products.ProductID
        AND
        	Products.CategoryID = Categories.CategoryID
GROUP BY
	Categories.CategoryID
ORDER BY
	COUNT(*)
    DESC;
```

**Q6) What was the total cost for each order?**
<br>A6) 
```
SELECT
    OrderDetails.OrderID
    SUM(OrderDetails.Quantity * Products.Price) as Total
FROM
    OrderDetails
    JOIN
        Products
    ON
        OrderDetails.ProductID = Products.ProductID  
GROUP BY
    OrderDetails.OrderID
ORDER BY
    Total
    DESC;
```

**Q7) Which employee made the most sales (by total price)?**
<br>A7) Margaret Peacock
```
SELECT
    Employees.EmployeeID,
    Employees.LastName,
    Employees.FirstName,
    SUM(OrderDetails.Quantity * Products.Price) as Total
FROM
    Employees
    JOIN
        Orders
    JOIN
        OrderDetails
    JOIN
        Products
    ON
        Orders.EmployeeID = Employees.EmployeeID
        AND
            Orders.OrderID = OrderDetails.OrderID
        AND
            OrderDetails.ProducTID = Products.ProductID
GROUP BY
    Employees.EmployeeID
ORDER BY
    Total
    DESC;
```

**Q8) Which employees have BS degrees? (Hint: look at the LIKE operator.)**
<br>A8) IDs: 1, 4, 6, 8, 9
```
SELECT * FROM Employees  WHERE Notes LIKE '%BA%'
```


**Q9) Which supplier of three or more products has the highest average product price? (Hint: look at the HAVING operator.)**
<br>A9) Tokyo Traders

```
SELECT 
	AVG(Price), Suppliers.SupplierName, Suppliers.SupplierID, COUNT(Products.ProductID)
FROM
	Products
	JOIN
    	Suppliers
    ON
    	Products.SupplierID=Suppliers.SupplierID
GROUP BY
	Suppliers.SupplierName
HAVING
    COUNT(Products.ProductID) > 2
ORDER BY
	AVG(Price) DESC
```

## Part II: Baseball Data

Please complete this exercise via SQLalchemy and Jupyter notebook.

We will be working with the Lahman baseball data we uploaded to your AWS instance in class.

1. What was the total spent on salaries by each team, each year?

2. What is the first and last year played for each player? Hint: Create a new table from 'Fielding.csv'.

3. Who has played the most all star games?

4. Which school has generated the most distinct players? Hint: Create new table from 'CollegePlaying.csv'.

5. Which players have the longest career? Assume that the debut and finalGame columns comprise the start and end, respectively, of a player's career. Hint: Create a new table from 'Master.csv'. Also note that strings can be converted to dates using the DATE function and can then be subtracted from each other yielding their difference in days.

6. What is the distribution of debut months? Hint: Look at the DATE and EXTRACT functions.

7. What is the effect of table join order on mean salary for the players listed in the main (master) table? Hint: Perform two different queries, one that joins on playerID in the salary table and other that joins on the same column in the master table. You will have to use left joins for each since right joins are not currently supported with SQLalchemy.

In [1]:
from sqlalchemy import create_engine
import pandas as pd
cnx = create_engine('postgresql://hhaq:haqckers@hh2010.me:5432/baseball')

In [2]:
pd.read_sql_query('''SELECT SUM(SALARY), yearid, teamid
                     FROM salaries
                     GROUP BY yearid, teamid
                     LIMIT 10;''',cnx)

          sum  yearid teamid
0  14807000.0    1985    ATL
1  11560712.0    1985    BAL
2  10897560.0    1985    BOS
3  14427894.0    1985    CAL
4   9846178.0    1985    CHA
5  12702917.0    1985    CHN
6   8359917.0    1985    CIN
7   6551666.0    1985    CLE
8  10348143.0    1985    DET
9   9993051.0    1985    HOU

In [3]:
pd.read_sql_query('''SELECT 
                         playerid, MIN(yearid), MAX(yearid)
                     FROM 
                         fielding
                     GROUP BY
                         playerid;''',cnx)

        playerid   min   max
0      gagnied01  1914  1915
1      ramospe01  1955  1970
2      putkolu01  2012  2013
3      boyerke01  1955  1969
4      dillibo01  1946  1951
5      jeterde01  1995  2013
6      sperrst01  1936  1938
7      vidrojo01  1997  2008
8      izturce01  2001  2013
9      clarkda06  2007  2007
10     mcglike01  1999  2000
11     hendero01  1994  1998
12     guantce01  1982  1990
13     smithto04  1973  1977
14     rickedi01  1959  1959
15     smithbi03  1886  1886
16     pitkoal01  1938  1939
17     webstle01  1989  2000
18      coledi01  1951  1957
19     starkma01  1987  1990
20     wilshwh01  1934  1936
21     patteda02  1968  1974
22     ventuvi01  1945  1945
23     jonesja03  1941  1948
24     hallmbi01  1888  1903
25     daviswi02  1960  1979
26     howariv01  1914  1917
27     asselbr01  1976  1981
28     trlicri01  1992  1997
29     lindsjo01  2010  2010
...          ...   ...   ...
17951  ulricdu01  1925  1927
17952   dealch01  1912  1921
17953  dunleja01  1903  1905
17954  mosolji01  1929  1933
17955  casanpa01  1965  1974
17956  esmonji01  1911  1915
17957  giustda01  1962  1977
17958  larkiba01  1986  2004
17959  catonho01  1917  1920
17960  chilepe01  1899  1900
17961  chrisru01  1942  1948
17962  bentlcy01  1872  1872
17963  mcguijo01  1876  1884
17964  wolfebr01  2007  2009
17965  stuarma01  1949  1954
17966  hestela01  1901  1901
17967  kennebi01  1942  1947
17968  dolanto01  1879  1888
17969  brainda01  1901  1908
17970  drucklo01  1909  1912
17971  mcgowbe01  1922  1937
17972  filipst01  1944  1948
17973  odonnjo01  1884  1884
17974  caithge01  1934  1934
17975  hortoel01  1896  1898
17976  rebelar01  1938  1945
17977  craigpe01  1964  1966
17978  tayloaa01  2002  2004
17979  encarlu01  1990  1990
17980   longje01  1964  1964

[17981 rows x 3 columns]

In [4]:
pd.read_sql_query('''SELECT 
                         COUNT(gameid), 
                         playerid
                     FROM 
                         AllstarFull 
                     GROUP BY
                         playerid
                     ORDER BY
                         COUNT(gameid)
                         DESC
                     LIMIT 1;''',cnx)

   count   playerid
0     25  aaronha01

In [5]:
pd.read_sql_query('''SELECT
                         COUNT(DISTINCT(playerid)) as Counts,
                         schoolid
                     FROM
                         collegeplaying
                     GROUP BY
                         schoolid
                     ORDER BY
                         Counts
                         DESC
                     LIMIT 1;''', cnx)

   counts schoolid
0     102      usc

In [8]:
pd.read_sql_query('''SELECT 
                         finalgame,
                         debut,
                         (finalgame - debut) as time,
                         namegiven
                     FROM 
                         master
                     WHERE finalgame IS NOT NULL 
                         AND 
                             debut IS NOT NULL
                     ORDER BY
                         time
                         DESC
                     LIMIT 10;''', cnx)

    finalgame       debut   time                namegiven
0  1933-10-01  1898-07-14  12862                 Nicholas
1  1904-09-22  1872-04-26  11836              James Henry
2  1980-10-05  1949-04-19  11492  Saturnino Orestes Armas
3  1934-09-30  1904-04-14  11126          Charles Timothy
4  1909-09-30  1880-07-05  10678         Walter Arlington
5  1912-05-18  1884-06-21  10192             James Thomas
6  1918-09-02  1891-06-01   9954             Hugh Ambrose
7  1929-10-06  1902-09-01   9897              John Joseph
8  1993-09-22  1966-09-11   9873               Lynn Nolan
9  1931-09-20  1904-09-13   9868            Charles Evard

   counts schoolid
0     102      usc